In [28]:
import pandas as pd
import numpy as np
import requests
from bs4 import BeautifulSoup

In [29]:
url = "https://www.the-numbers.com/movie/budgets/all"
res = requests.get(url)

In [30]:
soup = BeautifulSoup(res.text)

In [31]:
movies = soup.findAll('tr')

In [32]:
dates = []
names = []
budget = []
domestic_gross = []
ww_gross = []

for i in list(range(1, 101)):
    dates.append((movies[i].findAll('td')[1].string))
    names.append((movies[i].findAll('td')[2].string))
    budget.append((movies[i].findAll('td')[3].string))
    domestic_gross.append((movies[i].findAll('td')[4].string))
    ww_gross.append((movies[i].findAll('td')[5].string))
    
# dates    
# names
# budget

df = pd.DataFrame(list(zip(dates, names,budget,domestic_gross,ww_gross)), 
               columns =['Date', 'Name','Budget','Domestic Gross','WW_Gross']) 
df

,Date,Name,Budget,Domestic Gross,WW_Gross
0,"Apr 23, 2019",Avengers: Endgame,"$400,000,000","$858,373,000","$2,797,800,564"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$379,000,000","$241,063,875","$1,045,663,875"
2,"Apr 22, 2015",Avengers: Age of Ultron,"$365,000,000","$459,005,868","$1,403,013,963"
3,"Dec 16, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,068,223,624"
4,"Apr 25, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,359,754"
...,...,...,...,...,...
95,"Aug 10, 2007",Rush Hour 3,"$180,000,000","$140,125,968","$256,585,882"
96,"Jun 27, 2016",The Legend of Tarzan,"$180,000,000","$126,643,061","$348,902,025"
97,"Nov 23, 2011",Hugo,"$180,000,000","$73,864,507","$180,047,784"
98,"Jul 20, 2017",Valerian and the City of a Thousand Planets,"$180,000,000","$40,479,370","$215,098,356"
99,"Feb 6, 2015",Jupiter Ascending,"$179,000,000","$47,482,519","$181,982,519"

In [33]:
my_list = np.arange(101,1901,100)
my_list

array([ 101,  201,  301,  401,  501,  601,  701,  801,  901, 1001, 1101,
       1201, 1301, 1401, 1501, 1601, 1701, 1801])

In [35]:
data = pd.DataFrame([])

for index in my_list :
    url_1 = f"https://www.the-numbers.com/movie/budgets/all/{index}"
    res = requests.get(url_1)
    soup = BeautifulSoup(res.text)
    movies_1 = soup.findAll('tr')

    dates_1 = []
    names_1 = []
    budget_1= []
    domestic_gross_1 = []
    ww_gross_1 = []

    for a_1 in list(range(1, 101)):
        dates_1.append((movies_1[a_1].findAll('td')[1].string))
        names_1.append((movies_1[a_1].findAll('td')[2].string))
        budget_1.append((movies_1[a_1].findAll('td')[3].string))
        domestic_gross_1.append((movies_1[a_1].findAll('td')[4].string))
        ww_gross_1.append((movies_1[a_1].findAll('td')[5].string))


    df_1 = pd.DataFrame(list(zip(dates_1, names_1,budget_1,domestic_gross_1,ww_gross_1)), 
               columns =['Date', 'Name','Budget','Domestic Gross','WW_Gross']) 
    data = pd.DataFrame.append(data,df_1)

In [37]:
data.tail()

,Date,Name,Budget,Domestic Gross,WW_Gross
95,"Jan 22, 2010",Extraordinary Measures,"$31,000,000","$12,482,741","$15,826,984"
96,"Aug 25, 2017",Birth of the Dragon,"$31,000,000","$6,901,965","$7,220,490"
97,"Oct 20, 1995",Get Shorty,"$30,250,000","$72,021,008","$115,021,008"
98,"Jun 8, 1984",Ghostbusters,"$30,000,000","$242,212,467","$295,212,467"
99,"Nov 22, 1995",Toy Story,"$30,000,000","$191,796,233","$364,545,516"

In [38]:
to_concat = [df, data]
combined_df = pd.concat(to_concat)

In [41]:
combined_df.tail()

,Date,Name,Budget,Domestic Gross,WW_Gross
95,"Jan 22, 2010",Extraordinary Measures,"$31,000,000","$12,482,741","$15,826,984"
96,"Aug 25, 2017",Birth of the Dragon,"$31,000,000","$6,901,965","$7,220,490"
97,"Oct 20, 1995",Get Shorty,"$30,250,000","$72,021,008","$115,021,008"
98,"Jun 8, 1984",Ghostbusters,"$30,000,000","$242,212,467","$295,212,467"
99,"Nov 22, 1995",Toy Story,"$30,000,000","$191,796,233","$364,545,516"

In [42]:
combined_df.reset_index()

,index,Date,Name,Budget,Domestic Gross,WW_Gross
0,0,"Apr 23, 2019",Avengers: Endgame,"$400,000,000","$858,373,000","$2,797,800,564"
1,1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$379,000,000","$241,063,875","$1,045,663,875"
2,2,"Apr 22, 2015",Avengers: Age of Ultron,"$365,000,000","$459,005,868","$1,403,013,963"
3,3,"Dec 16, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,068,223,624"
4,4,"Apr 25, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,359,754"
...,...,...,...,...,...,...
1895,95,"Jan 22, 2010",Extraordinary Measures,"$31,000,000","$12,482,741","$15,826,984"
1896,96,"Aug 25, 2017",Birth of the Dragon,"$31,000,000","$6,901,965","$7,220,490"
1897,97,"Oct 20, 1995",Get Shorty,"$30,250,000","$72,021,008","$115,021,008"
1898,98,"Jun 8, 1984",Ghostbusters,"$30,000,000","$242,212,467","$295,212,467"
1899,99,"Nov 22, 1995",Toy Story,"$30,000,000","$191,796,233","$364,545,516"

In [43]:
combined_df.to_csv('1900movies_budget_domesticgross_WW_gross.csv')

In [213]:
df1 = pd.read_csv('budget_page1.csv')

In [215]:
df2 = pd.read_csv('budget_page2.csv')

In [216]:
df3 = pd.read_csv('budget_page3.csv')

In [217]:
df4 = pd.read_csv('budget_page4.csv')

In [218]:
df5 = pd.read_csv('budget_page5.csv')

In [219]:
df6 = pd.read_csv('budget_page6.csv')

In [220]:
df7 = pd.read_csv('budget_page7.csv')

In [221]:
df8 = pd.read_csv('budget_page8.csv')

In [222]:
df9 = pd.read_csv('budget_page9.csv')

In [223]:
df10 = pd.read_csv('budget_page10.csv')

In [224]:
df11 = pd.read_csv('budget_page11.csv')

In [225]:
df12 = pd.read_csv('budget_page12.csv')

In [226]:
df13 = pd.read_csv('budget_page13.csv')

In [227]:
df14 = pd.read_csv('budget_page14.csv')

In [228]:
df15= pd.read_csv('budget_page15.csv')

In [229]:
to_concat = [df1, df2, df3, df4, df5, df6, df7, df8, df9, df10, df11, df12, df13, df14, df15]
combined_df = pd.concat(to_concat)

In [233]:
combined_df.tail()

,Unnamed: 0,Date,Name,Budget
95,95,"Aug 12, 2011",Final Destination 5,"$40,000,000"
96,96,"Nov 9, 2018",Widows,"$40,000,000"
97,97,"Apr 8, 2005",Fever Pitch,"$40,000,000"
98,98,"Dec 25, 2007",Aliens vs. Predator - Requiem,"$40,000,000"
99,99,"Dec 25, 2007",The Water Horse: Legend of the Deep,"$40,000,000"

In [234]:
combined_df.reset_index()

,index,Unnamed: 0,Date,Name,Budget
0,0,0,"Apr 23, 2019",Avengers: Endgame,"$400,000,000"
1,1,1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$379,000,000"
2,2,2,"Apr 22, 2015",Avengers: Age of Ultron,"$365,000,000"
3,3,3,"Dec 16, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000"
4,4,4,"Apr 25, 2018",Avengers: Infinity War,"$300,000,000"
...,...,...,...,...,...
1495,95,95,"Aug 12, 2011",Final Destination 5,"$40,000,000"
1496,96,96,"Nov 9, 2018",Widows,"$40,000,000"
1497,97,97,"Apr 8, 2005",Fever Pitch,"$40,000,000"
1498,98,98,"Dec 25, 2007",Aliens vs. Predator - Requiem,"$40,000,000"
1499,99,99,"Dec 25, 2007",The Water Horse: Legend of the Deep,"$40,000,000"

In [235]:
combined_df.to_csv('allmovies_budget.csv')